import React, { FC } from 'react';
import { useI18n } from '@/src/locales';

interface IProps {}

const ProductDescription: FC<IProps> = (props) => {
	const t = useI18n();
	return (
		<div className={'mt-[15px]'}>
			<p className={'f-16-500 c_2D2D2D mb-[15px]'}>
				هناك حقيقة مثبتة منذ زمن محتوى اعلي المقروء لصفحة ما سلي التركيز
				على نحو الشكل الخارجي وكأنها نص مقروء. العديد من برامح النشر
				المكتبي الشكل الخارجي للنص منذ زمن محتوى اعلي االمكتبي الشكل
				الخارجي للنص هناك حقيقة مثبتة منذ زمن محتوى اعلي المقروء لصفحة
				ما سلي التركيز على وكأنها نص مقروء. العديد من برامح النشر
				المكتبي الشكل الخارجي للنصحقيقة مثبتة
			</p>
			<ul className={'info-list'}>
				<li>
					كانت المتاخمة التغييرات أم وفي. ان وانتهاءً باستحداث قهر. ان
					ضمنهاي للنص منذ زمن
				</li>
				<li>
					الشكل الخارجي وكأنها نص مقروء. العديد من برامح النشر المكتبي
					الشكل الخارجي للنص منذ زمن
				</li>
				<li>
					كأنها نص مقروء. العديد من برامح النشر المكتبي الشكل الخارجي
					للنص منذ زمن
				</li>
				<li>
					الشكل الخارجي وكأنها نص مقروء. العديد من برامح النشر المكتبي
					الشكل الخارجي للنص منذ زمن
				</li>
				<li>
					إذ لها الأول الستار, تحت وصغار مدينة عل. أي بحشد ليرتفع
					الساحلية أما, ليركز الهادي للأسطول ما هذا
				</li>
			</ul>
		</div>
	);
};
export default ProductDescription;
